###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/28d48b86-7c58-4d31-a41d-69694dae0236/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc-prod.aws_internet_gateway.igw has been deleted
  - resource "aws_internet_gateway" "igw" {
      - arn      = "arn:aws:ec2:us-east-1:816915057134:internet-gateway/igw-09ef65110f6b172ff" -> null
      - id       = "igw-09ef65110f6b172ff" -> null
      - owner_id = "816915057134" -> null
      - tags     = {
          - "Name"    = "Group6-prod-igw"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all = {
          - "Name"    = "Group6-prod-igw"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id   = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_route_table.private has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:816915057134:route-table/rtb-06376acc769260fca" -> null
      - id               = "rtb-06376acc769260fca" -> null
      - owner_id         = "816915057134" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name"    = "Group6-prod-private-route-table"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all         = {
          - "Name"    = "Group6-prod-private-route-table"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id           = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_route_table.public has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:816915057134:route-table/rtb-066f8fa8af5630fd6" -> null
      - id               = "rtb-066f8fa8af5630fd6" -> null
      - owner_id         = "816915057134" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-09ef65110f6b172ff"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"    = "Group6-prod-public-route-table"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all         = {
          - "Name"    = "Group6-prod-public-route-table"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id           = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_route_table_association.private[0] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0703381a647f577b2" -> null
      - route_table_id = "rtb-06376acc769260fca" -> null
      - subnet_id      = "subnet-0e3491939cc453da0" -> null
    }

  # module.vpc-prod.aws_route_table_association.private[1] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-05a6ffa48146de29d" -> null
      - route_table_id = "rtb-06376acc769260fca" -> null
      - subnet_id      = "subnet-0237842489dba8f3b" -> null
    }

  # module.vpc-prod.aws_route_table_association.public[0] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-07033555c818cb3c1" -> null
      - route_table_id = "rtb-066f8fa8af5630fd6" -> null
      - subnet_id      = "subnet-0dfa91d71dd8fabb1" -> null
    }

  # module.vpc-prod.aws_route_table_association.public[1] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-020bb6a0bf2ce2ce5" -> null
      - route_table_id = "rtb-066f8fa8af5630fd6" -> null
      - subnet_id      = "subnet-0e4affda2f58d8762" -> null
    }

  # module.vpc-prod.aws_route_table_association.public[2] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-041cdef5c2856c384" -> null
      - route_table_id = "rtb-066f8fa8af5630fd6" -> null
      - subnet_id      = "subnet-0e48731d92dc1faa2" -> null
    }

  # module.vpc-prod.aws_route_table_association.public[3] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-03f12f99544a28a28" -> null
      - route_table_id = "rtb-066f8fa8af5630fd6" -> null
      - subnet_id      = "subnet-0be53ff3b8bbc1718" -> null
    }

  # module.vpc-prod.aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0e3491939cc453da0" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.1.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e3491939cc453da0" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "816915057134" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"    = "Group6-prod-private-subnet-1"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                                       = {
          - "Name"    = "Group6-prod-private-subnet-1"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0237842489dba8f3b" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.1.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0237842489dba8f3b" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "816915057134" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"    = "Group6-prod-private-subnet-2"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                                       = {
          - "Name"    = "Group6-prod-private-subnet-2"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0dfa91d71dd8fabb1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.1.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0dfa91d71dd8fabb1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "816915057134" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"    = "Group6-prod-public-subnet-1"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                                       = {
          - "Name"    = "Group6-prod-public-subnet-1"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_subnet.public[1] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0e4affda2f58d8762" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.1.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e4affda2f58d8762" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "816915057134" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"    = "Group6-prod-public-subnet-2"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                                       = {
          - "Name"    = "Group6-prod-public-subnet-2"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_subnet.public[2] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0e48731d92dc1faa2" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.1.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e48731d92dc1faa2" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "816915057134" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"    = "Group6-prod-public-subnet-3"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                                       = {
          - "Name"    = "Group6-prod-public-subnet-3"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_subnet.public[3] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0be53ff3b8bbc1718" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1d" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.1.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0be53ff3b8bbc1718" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "816915057134" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"    = "Group6-prod-public-subnet-4"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                                       = {
          - "Name"    = "Group6-prod-public-subnet-4"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null
    }

  # module.vpc-prod.aws_vpc.main has been deleted
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:vpc/vpc-03dbd249d59d84535" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.1.0.0/16" -> null
      - default_network_acl_id               = "acl-0dde83ae936f5150e" -> null
      - default_route_table_id               = "rtb-0055694433c5d5143" -> null
      - default_security_group_id            = "sg-00bbb8b76043280e1" -> null
      - dhcp_options_id                      = "dopt-04193627c5facc476" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-03dbd249d59d84535" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0055694433c5d5143" -> null
      - owner_id                             = "816915057134" -> null
      - tags                                 = {
          - "Name"    = "Group6-prod-vpc"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
      - tags_all                             = {
          - "Name"    = "Group6-prod-vpc"
          - "Owner"   = "Group6"
          - "Project" = "Final Project"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc-prod.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "Group6-prod-igw"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all = {
          + "Name"    = "Group6-prod-igw"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc-prod.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"    = "Group6-prod-private-route-table"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all         = {
          + "Name"    = "Group6-prod-private-route-table"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"    = "Group6-prod-public-route-table"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all         = {
          + "Name"    = "Group6-prod-public-route-table"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[3] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "Group6-prod-private-subnet-1"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                                       = {
          + "Name"    = "Group6-prod-private-subnet-1"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "Group6-prod-private-subnet-2"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                                       = {
          + "Name"    = "Group6-prod-private-subnet-2"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "Group6-prod-public-subnet-1"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                                       = {
          + "Name"    = "Group6-prod-public-subnet-1"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "Group6-prod-public-subnet-2"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                                       = {
          + "Name"    = "Group6-prod-public-subnet-2"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "Group6-prod-public-subnet-3"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                                       = {
          + "Name"    = "Group6-prod-public-subnet-3"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[3] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "Group6-prod-public-subnet-4"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                                       = {
          + "Name"    = "Group6-prod-public-subnet-4"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "Group6-prod-vpc"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
      + tags_all                             = {
          + "Name"    = "Group6-prod-vpc"
          + "Owner"   = "Group6"
          + "Project" = "Final Project"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ private_subnet_ids = [
      - "subnet-0e3491939cc453da0",
      - "subnet-0237842489dba8f3b",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_subnet_ids  = [
      - "subnet-0dfa91d71dd8fabb1",
      - "subnet-0e4affda2f58d8762",
      - "subnet-0e48731d92dc1faa2",
      - "subnet-0be53ff3b8bbc1718",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ vpc_id             = "vpc-03dbd249d59d84535" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # module.vpc-prod.aws_internet_gateway.igw has been deleted%0A  - resource "aws_internet_gateway" "igw" {%0A      - arn      = "arn:aws:ec2:us-east-1:816915057134:internet-gateway/igw-09ef65110f6b172ff" -> null%0A      - id       = "igw-09ef65110f6b172ff" -> null%0A      - owner_id = "816915057134" -> null%0A      - tags     = {%0A          - "Name"    = "Group6-prod-igw"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all = {%0A          - "Name"    = "Group6-prod-igw"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id   = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table.private has been deleted%0A  - resource "aws_route_table" "private" {%0A      - arn              = "arn:aws:ec2:us-east-1:816915057134:route-table/rtb-06376acc769260fca" -> null%0A      - id               = "rtb-06376acc769260fca" -> null%0A      - owner_id         = "816915057134" -> null%0A      - propagating_vgws = [] -> null%0A      - route            = [] -> null%0A      - tags             = {%0A          - "Name"    = "Group6-prod-private-route-table"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all         = {%0A          - "Name"    = "Group6-prod-private-route-table"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id           = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table.public has been deleted%0A  - resource "aws_route_table" "public" {%0A      - arn              = "arn:aws:ec2:us-east-1:816915057134:route-table/rtb-066f8fa8af5630fd6" -> null%0A      - id               = "rtb-066f8fa8af5630fd6" -> null%0A      - owner_id         = "816915057134" -> null%0A      - propagating_vgws = [] -> null%0A      - route            = [%0A          - {%0A              - carrier_gateway_id         = ""%0A              - cidr_block                 = "0.0.0.0/0"%0A              - core_network_arn           = ""%0A              - destination_prefix_list_id = ""%0A              - egress_only_gateway_id     = ""%0A              - gateway_id                 = "igw-09ef65110f6b172ff"%0A              - instance_id                = ""%0A              - ipv6_cidr_block            = ""%0A              - local_gateway_id           = ""%0A              - nat_gateway_id             = ""%0A              - network_interface_id       = ""%0A              - transit_gateway_id         = ""%0A              - vpc_endpoint_id            = ""%0A              - vpc_peering_connection_id  = ""%0A            },%0A        ] -> null%0A      - tags             = {%0A          - "Name"    = "Group6-prod-public-route-table"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all         = {%0A          - "Name"    = "Group6-prod-public-route-table"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id           = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private[0] has been deleted%0A  - resource "aws_route_table_association" "private" {%0A      - id             = "rtbassoc-0703381a647f577b2" -> null%0A      - route_table_id = "rtb-06376acc769260fca" -> null%0A      - subnet_id      = "subnet-0e3491939cc453da0" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private[1] has been deleted%0A  - resource "aws_route_table_association" "private" {%0A      - id             = "rtbassoc-05a6ffa48146de29d" -> null%0A      - route_table_id = "rtb-06376acc769260fca" -> null%0A      - subnet_id      = "subnet-0237842489dba8f3b" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[0] has been deleted%0A  - resource "aws_route_table_association" "public" {%0A      - id             = "rtbassoc-07033555c818cb3c1" -> null%0A      - route_table_id = "rtb-066f8fa8af5630fd6" -> null%0A      - subnet_id      = "subnet-0dfa91d71dd8fabb1" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[1] has been deleted%0A  - resource "aws_route_table_association" "public" {%0A      - id             = "rtbassoc-020bb6a0bf2ce2ce5" -> null%0A      - route_table_id = "rtb-066f8fa8af5630fd6" -> null%0A      - subnet_id      = "subnet-0e4affda2f58d8762" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[2] has been deleted%0A  - resource "aws_route_table_association" "public" {%0A      - id             = "rtbassoc-041cdef5c2856c384" -> null%0A      - route_table_id = "rtb-066f8fa8af5630fd6" -> null%0A      - subnet_id      = "subnet-0e48731d92dc1faa2" -> null%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[3] has been deleted%0A  - resource "aws_route_table_association" "public" {%0A      - id             = "rtbassoc-03f12f99544a28a28" -> null%0A      - route_table_id = "rtb-066f8fa8af5630fd6" -> null%0A      - subnet_id      = "subnet-0be53ff3b8bbc1718" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private[0] has been deleted%0A  - resource "aws_subnet" "private" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0e3491939cc453da0" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1a" -> null%0A      - availability_zone_id                           = "use1-az1" -> null%0A      - cidr_block                                     = "10.1.5.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0e3491939cc453da0" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "816915057134" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "Name"    = "Group6-prod-private-subnet-1"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name"    = "Group6-prod-private-subnet-1"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private[1] has been deleted%0A  - resource "aws_subnet" "private" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0237842489dba8f3b" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1b" -> null%0A      - availability_zone_id                           = "use1-az2" -> null%0A      - cidr_block                                     = "10.1.6.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0237842489dba8f3b" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "816915057134" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "Name"    = "Group6-prod-private-subnet-2"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name"    = "Group6-prod-private-subnet-2"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[0] has been deleted%0A  - resource "aws_subnet" "public" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0dfa91d71dd8fabb1" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1a" -> null%0A      - availability_zone_id                           = "use1-az1" -> null%0A      - cidr_block                                     = "10.1.1.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0dfa91d71dd8fabb1" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "816915057134" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "Name"    = "Group6-prod-public-subnet-1"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name"    = "Group6-prod-public-subnet-1"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[1] has been deleted%0A  - resource "aws_subnet" "public" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0e4affda2f58d8762" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1b" -> null%0A      - availability_zone_id                           = "use1-az2" -> null%0A      - cidr_block                                     = "10.1.2.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0e4affda2f58d8762" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "816915057134" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "Name"    = "Group6-prod-public-subnet-2"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name"    = "Group6-prod-public-subnet-2"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[2] has been deleted%0A  - resource "aws_subnet" "public" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0e48731d92dc1faa2" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1c" -> null%0A      - availability_zone_id                           = "use1-az4" -> null%0A      - cidr_block                                     = "10.1.3.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0e48731d92dc1faa2" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "816915057134" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "Name"    = "Group6-prod-public-subnet-3"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name"    = "Group6-prod-public-subnet-3"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[3] has been deleted%0A  - resource "aws_subnet" "public" {%0A      - arn                                            = "arn:aws:ec2:us-east-1:816915057134:subnet/subnet-0be53ff3b8bbc1718" -> null%0A      - assign_ipv6_address_on_creation                = false -> null%0A      - availability_zone                              = "us-east-1d" -> null%0A      - availability_zone_id                           = "use1-az6" -> null%0A      - cidr_block                                     = "10.1.4.0/24" -> null%0A      - enable_dns64                                   = false -> null%0A      - enable_resource_name_dns_a_record_on_launch    = false -> null%0A      - enable_resource_name_dns_aaaa_record_on_launch = false -> null%0A      - id                                             = "subnet-0be53ff3b8bbc1718" -> null%0A      - ipv6_native                                    = false -> null%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      - map_public_ip_on_launch                        = false -> null%0A      - owner_id                                       = "816915057134" -> null%0A      - private_dns_hostname_type_on_launch            = "ip-name" -> null%0A      - tags                                           = {%0A          - "Name"    = "Group6-prod-public-subnet-4"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                                       = {%0A          - "Name"    = "Group6-prod-public-subnet-4"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - vpc_id                                         = "vpc-03dbd249d59d84535" -> null%0A    }%0A%0A  # module.vpc-prod.aws_vpc.main has been deleted%0A  - resource "aws_vpc" "main" {%0A      - arn                                  = "arn:aws:ec2:us-east-1:816915057134:vpc/vpc-03dbd249d59d84535" -> null%0A      - assign_generated_ipv6_cidr_block     = false -> null%0A      - cidr_block                           = "10.1.0.0/16" -> null%0A      - default_network_acl_id               = "acl-0dde83ae936f5150e" -> null%0A      - default_route_table_id               = "rtb-0055694433c5d5143" -> null%0A      - default_security_group_id            = "sg-00bbb8b76043280e1" -> null%0A      - dhcp_options_id                      = "dopt-04193627c5facc476" -> null%0A      - enable_classiclink                   = false -> null%0A      - enable_classiclink_dns_support       = false -> null%0A      - enable_dns_hostnames                 = false -> null%0A      - enable_dns_support                   = true -> null%0A      - enable_network_address_usage_metrics = false -> null%0A      - id                                   = "vpc-03dbd249d59d84535" -> null%0A      - instance_tenancy                     = "default" -> null%0A      - ipv6_netmask_length                  = 0 -> null%0A      - main_route_table_id                  = "rtb-0055694433c5d5143" -> null%0A      - owner_id                             = "816915057134" -> null%0A      - tags                                 = {%0A          - "Name"    = "Group6-prod-vpc"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A      - tags_all                             = {%0A          - "Name"    = "Group6-prod-vpc"%0A          - "Owner"   = "Group6"%0A          - "Project" = "Final Project"%0A        } -> null%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc-prod.aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name"    = "Group6-prod-igw"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all = {%0A          + "Name"    = "Group6-prod-igw"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table.private will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name"    = "Group6-prod-private-route-table"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all         = {%0A          + "Name"    = "Group6-prod-private-route-table"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table.public will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Name"    = "Group6-prod-public-route-table"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all         = {%0A          + "Name"    = "Group6-prod-public-route-table"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[2] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_route_table_association.public[3] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"    = "Group6-prod-private-subnet-1"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all                                       = {%0A          + "Name"    = "Group6-prod-private-subnet-1"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"    = "Group6-prod-private-subnet-2"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all                                       = {%0A          + "Name"    = "Group6-prod-private-subnet-2"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"    = "Group6-prod-public-subnet-1"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all                                       = {%0A          + "Name"    = "Group6-prod-public-subnet-1"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"    = "Group6-prod-public-subnet-2"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all                                       = {%0A          + "Name"    = "Group6-prod-public-subnet-2"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[2] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"    = "Group6-prod-public-subnet-3"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + tags_all                                       = {%0A          + "Name"    = "Group6-prod-public-subnet-3"%0A          + "Owner"   = "Group6"%0A          + "Project" = "Final Project"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-prod.aws_subnet.public[3] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = 
  ```
  </details>
  *Pusher: @solipkimm, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*